CSI API ETABS v1
cDatabaseTables.GetTableForDisplayArray Method
 Returns data for a single table in a single array. If there is nothing to be shown in the table then no data is returned.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForDisplayArray(
	string TableKey,
	ref string[] FieldKeyList,
	string GroupName,
	ref int TableVersion,
	ref string[] FieldsKeysIncluded,
	ref int NumberRecords,
	ref string[] TableData
)
Function GetTableForDisplayArray (
	TableKey As String,
	ByRef FieldKeyList As String(),
	GroupName As String,
	ByRef TableVersion As Integer,
	ByRef FieldsKeysIncluded As String(),
	ByRef NumberRecords As Integer,
	ByRef TableData As String()
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim FieldKeyList As String()
Dim GroupName As String
Dim TableVersion As Integer
Dim FieldsKeysIncluded As String()
Dim NumberRecords As Integer
Dim TableData As String()
Dim returnValue As Integer
returnValue = instance.GetTableForDisplayArray(TableKey,
	FieldKeyList, GroupName, TableVersion,
	FieldsKeysIncluded, NumberRecords,
	TableData)
int GetTableForDisplayArray(
	String^ TableKey,
	array<String^>^% FieldKeyList,
	String^ GroupName,
	int% TableVersion,
	array<String^>^% FieldsKeysIncluded,
	int% NumberRecords,
	array<String^>^% TableData
)
abstract GetTableForDisplayArray :
        TableKey : string *
        FieldKeyList : string[] byref *
        GroupName : string *
        TableVersion : int byref *
        FieldsKeysIncluded : string[] byref *
        NumberRecords : int byref *
        TableData : string[] byref -> int
Parameters
TableKey
Type: System.String
Input Item: The table key of the table for which data is requested.
FieldKeyList
Type: System.String[]
Input Item: A zero-based array listing the field keys associated with the specified table for which data is requested.
GroupName
Type: System.String
Input Item: The name of a group for which data will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
FieldsKeysIncluded
Type: System.String[]
 Returned Item: A zero-based array listing the field keys associated with the specified table for which data is reported in the order it is reported in the TableData array. These are essentially the column headers of the data returned in TableData.
NumberRecords
Type: System.Int32
Returned Item: The number of records of data returned for each field. This is essentially the number of rows of data.
TableData
Type: System.String[]
Returned Item: A zero-based, one-dimensional array of the table data, excluding headers, returned row by row. The format of the data is explained below.
 As an example, suppose there are three fields in the FieldsKeysIncluded array and the NumberRecords is five.
EXAMPLE Material Name | Type | Density
A992Fy50 | Steel | 490
4000Psi | Concrete | 150
A615Gr60 | Rebar | 480
A416Gr270 | Tendon | 470
6061T6 | Aluminum | 170
 The data is returned row by row, and items 0 thru 2 in this array would be the first row, items 3 thru 5 the second row, etc, and items 12 thru 14 the fifth row. Using the example of the table above, the returned array would look like this: {A992Fy50, Steel, 490, 4000Psi, Concrete, 150, A615Gr60, Rebar, 480, A416Gr270, Tendon, 470, 6061T6, Aluminum, 170}
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 If the FieldKeyList array contains a single blank string the data will be provided for all fields. If the GroupName is All, or a blank string, then data will be returned for all applicable objects in the model.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace